{"tags": ["xml", "json", "database", "dictionary", "data-interchange"], "comments": [{"score": 0, "creation_date": 1416265594, "post_id": 26981520, "comment_id": 42501319, "body": "You could finish up in an excel doc then write a script to read it in and insert it into a database since you already started in an excel doc. But I do recommend migrating to a database. It&#39;ll be easier to manage."}, {"score": 0, "creation_date": 1416267467, "post_id": 26981520, "comment_id": 42501888, "body": "no problem, I&#39;ve not done much but you mean I can start typing directly into a database? and that&#39;d be better"}, {"score": 0, "creation_date": 1416267694, "post_id": 26981520, "comment_id": 42501945, "body": "Dbs do have interfaces to add data directly. MySQL often uses phpMyAdmin. Microsoft offers free software to manage DBs, which should allow the use of directly adding data without a query."}, {"score": 0, "creation_date": 1416268096, "post_id": 26981520, "comment_id": 42502081, "body": "I can use mysql workbench, but my question now is, will this data be portable to nosql databases from there?"}, {"score": 0, "creation_date": 1416268292, "post_id": 26981520, "comment_id": 42502145, "body": "NoSQL structures data differently, so that might be difficult. If you are going to do a NoSQL DB in the end, I would just do it now."}, {"score": 0, "creation_date": 1416268603, "post_id": 26981520, "comment_id": 42502232, "body": "well decision is neutral, if sql db is good for this kind of app (dictionary), I&#39;ll stick to it, do you think a data architecture/document for a dictionary app can be done in NoSQL, I&#39;d pick it up (I&#39;m not much familiar with NoSQL at the moment, have to study)"}, {"score": 0, "creation_date": 1416268876, "post_id": 26981520, "comment_id": 42502315, "body": "Though you would have to learn NoSQL, I would recommend using it since it is more of a document structure. Creating a relational structure for simple data might be a little to complex. If this answers your question, I&#39;ll post it as an answer so that this q can be closed."}, {"score": 0, "creation_date": 1416269007, "post_id": 26981520, "comment_id": 42502350, "body": "yes, we are getting close, and you can post as an answer, last I believe dictionary app won&#39;t have a relation, just word and it&#39;s translation (unless I add synonyms etc.) but in your experience do you find using NoSQL doable and manageable for such app?"}, {"score": 0, "creation_date": 1416269302, "post_id": 26981520, "comment_id": 42502439, "body": "I&#39;ll be honest, I am most familiar with SQL and MySQL, but from my research, it seems doable and I would argue, more practical. MongoDB seems to be a good NoSQL DBMS. I&#39;ll post more in a answer"}, {"score": 0, "creation_date": 1416325787, "post_id": 26981520, "comment_id": 42527096, "body": "never mind, I&#39;ve got my answer"}], "answers": [{"score": 0, "last_activity_date": 1416269809, "answer_id": 26984422, "question_id": 26981520, "body": "<p>Most DBMSs have a way to input data directly using some built in interface, or external interface. I would move to a DBMS because it will be easier to manage your data. As for the type of DBMS, a NoSQL would be recommended, like <a href=\"http://www.mongodb.org/\" rel=\"nofollow\">MongoDB</a>. This way the data will stay in a document oriented structure, which seems to better suit dictionary data. NoSQL converts things to JSON and stores that. So it should be very quick and scalable. This is my recommendation for a dictionary app. Good luck!</p>\n"}], "is_answered": true, "answer_count": 1, "score": 0, "last_activity_date": 1416269809, "creation_date": 1416256642, "question_id": 26981520, "title": "Dictionary app web service", "body": "<p>Right now I'm writing up terms and their translations for this English to Urdu language in an excel sheet and what I'm concerned about to make data interchangeable.</p>\n\n<p>Later one once I'm finished I might have a web service to JSON or XML from a mySQL database or from a nosql database.</p>\n\n<p>My question is how to organize and write this information at this stage so I'd be able to transform and utilize this huge data into one of the above formats based on the need. Shall I keep writing in excel, or write stuff directly in a database (nosql I've no idea at the moment)</p>\n\n<p>The app will be used on phones (iOS, android), desktop (mac/win) and a browser.</p>\n"}