{"tags": ["regex", "flex-lexer", "lexical-analysis"], "answers": [{"answer_id": 67739668, "question_id": 67738350, "body": "<p>I asked the question when I was facing problem. Now I have solved my problem and I am posting here the answer so that who need the answer of this question can be benefited.</p>\n<p><strong>Regular expression for matching white spaces in FLEX is :</strong></p>\n<pre><code>([ ])\n</code></pre>\n<p><strong>Note:</strong> Must have contain a white space between two square brackets.</p>\n"}, {"answer_id": 67742453, "question_id": 67738350, "body": "<p>If you just want to match a space character, you can use <code>&quot; &quot;</code> or <code>[ ]</code>. But that is not the equivalent of <code>\\s</code> in typical regex libraries, which will match any single-byte whitespace character, including tabs and newlines. Flex does not recognise escape sequences like <code>\\s</code>, <code>\\d</code>, or<code>\\w</code>, which might work in regex packages.</p>\n<p>Flex does have two built-in sets which you can use inside a character class. (Note that &quot;inside a character class&quot; implies that you need to surround these with additional <code>[…]</code>):</p>\n<ul>\n<li><code>[:space:]</code> means exactly what <code>\\s</code> would mean: any whitespace character, horizontal or vertical.</li>\n<li><code>[:blank:]</code> is only horizontal white space: spaces and tabs.</li>\n</ul>\n<p>You can combine these freely with other characters in a character class. Thus, <code>[[:blank:]]</code> will match a single space or tab character, while <code>[[:space:],;]</code> will match any whitespace character at all as well as comma and semicolon.</p>\n<p>Often, you would want to match a <em>sequence</em> of whitespace characters, not just a single one. Otherwise, you will miscount words; <code>the  other  one</code> has four spaces, but there are only three words.</p>\n<p>To match a sequence, use the &quot;one or more repetitions&quot; operator, <code>+</code>: <code>[[:space:]]+</code>. This is also more efficient. And it doesn't stop you from counting characters as well, because in the action the variable <code>yyleng</code> is the number of characters matched by the pattern.</p>\n<p>For more information, see the <a href=\"http://westes.github.io/flex/manual/Patterns.html#Patterns\" rel=\"nofollow noreferrer\">Flex manual</a>.</p>\n"}], "is_answered": true, "answer_count": 2, "last_activity_date": 1622219509, "question_id": 67738350, "title": "What is the regular expression for matching white space among words in a sentence for FLEX?", "body": "<p>I want to first match the white spaces among words then want to count total number of white spaces in a sentence. I am trying in this below way ,</p>\n<pre><code>%{\n#undef yywrap\n#define yywrap() 1\nint VowelCount = 0;\nint ConsonantCount=0;\nint CountWhiteSpace=0;\nint CountNewLine=0;\nint CountInteger=0;\nint CountFloat=0;\n%}\n%%\n[aeiouAEIOU] {++VowelCount;}\n[bcdBCDfghFGHjklmnJKLMNpqrstPQRSTvwxyzVWXYZ] {++ConsonantCount;}\n[0-9] {++CountInteger;}\n[0-9]*[.][0-9]+ {++CountFloat;}\n[\\s]  {++CountWhiteSpace;}\n\\n    {++CountNewLine;}\nend {return 0;}       \n%%\nint main(){\nyylex();\nprintf(&quot;\\nNumber of vowel in the given input  %d\\n&quot;, VowelCount);\nprintf(&quot;\\nNumber of consonant in the given input %d\\n&quot;,ConsonantCount);\nprintf(&quot;\\nNumber of integer in the given input %d\\n&quot;,CountInteger);\nprintf(&quot;\\nNumber of float in the given input %d\\n&quot;,CountFloat);\nprintf(&quot;\\nNumber of line in the given input %d\\n&quot;,CountNewLine);\nprintf(&quot;\\nTotal white space count %d\\n&quot;,CountWhiteSpace); \nreturn 0;\n}\n</code></pre>\n<p>but I am getting error something like:</p>\n<p><strong>line 16:Warning, rule cannot be matched.</strong><br>\nI am able to achieve vowel, consonant, new line, integer and float count but I am facing for white space count. I want to count whitespace in below way:<br>\ninput: I am Ashiqur Rahman.<br>\nOutput:3 //number of white space among words I, am, Ashiqur, Rahman.<br>\nHow can I achieve it in FLEX? Thanks in advance.</p>\n"}