{"tags": ["django", "iis"], "comments": [{"post_id": 68437914, "comment_id": 120972677, "body": "Is this <a href=\"https://stackoverflow.com/questions/32312590/how-to-fetch-static-css-files-with-django-on-iis\">post</a> helpful to your problem ?"}, {"post_id": 68437914, "comment_id": 120974057, "body": "Hello Hury, no, it doesn&#39;t help, I have the setup explained here. I am able to serve static content, my issue is trying to serve static content from 2 different places without runnig hte collectstatic (since the folder is big)  I&#39;m able to serve with a virtual directory static to 1 path but I don&#39;t know how to serve my 2nd path"}, {"post_id": 68437914, "comment_id": 120974323, "body": "Do you mean add two paths as &quot;Physical path&quot; for static virtual directory ?"}, {"post_id": 68437914, "comment_id": 120974749, "body": "yes, right now, as the screenshot, my virtual directory points to 1 path (network drive) however I have content I also need to serve from a 2nd network drive, and I don&#39;t have where to point this one since the &quot;static&quot; alias is already used. does this makes sense?"}, {"post_id": 68437914, "comment_id": 120974793, "body": "from the screenshot, my static alias in IIS points to  &quot;//server1/Shared1/folder/&quot; but I need to also access to the static files in &quot;//Server2/folder2/&quot; where and how do I set this in iis?"}, {"post_id": 68437914, "comment_id": 120975003, "body": "In my opinion, we can&#39;t specify two physical paths for virtual path. But as a workaround, maybe you can have a try with create a new shared folder which contains the two folder (<code>&#47;&#47;server1&#47;Shared1&#47;folder&#47;</code> and <code>&#47;&#47;Server2&#47;folder2&#47;</code>). Then use the new created shared folder as physical path."}, {"post_id": 68437914, "comment_id": 120975083, "body": "to create them with shortcuts would work? because they&#39;re in different network drives, I can&#39;t just move them to the same location and then point to that one. I&#39;ll try creating a folder in my webserver, that has shortcuts to the network drives of the 2 locations, and then point to that folder, is this what you mean?"}, {"post_id": 68437914, "comment_id": 120975331, "body": "I&#39;m not sure if this workaround can work, just suggest you have a try."}, {"post_id": 68437914, "comment_id": 120975353, "body": "yes, I understand, but I understood correctly your suggestion?  thank you!"}, {"post_id": 68437914, "comment_id": 120975544, "body": "Yes, I think your description is what I mean."}, {"post_id": 68437914, "comment_id": 120975852, "body": "uhm, sadly doesn&#39;t work, when I get a full path including the shortcut, it breaks the link since the shortcut changes the absolute path to the network one :("}], "answers": [{"answer_id": 68452738, "question_id": 68437914, "body": "<p>For anyone that has the same type of issue. I was able to do this by adding a second virtual directory as subfolder for the first one</p>\n<p>-The first one pointing to shared drive X\n-The second one as subfolder pointing to shared drive Y with an alias</p>\n<p>and then I added a call for this second folder where needed such as &quot;static/2ndserver&quot;</p>\n<p>with this was able to get the files from both separate network locations without having to do a &quot;collectstatic&quot; and bring them to a third place.</p>\n<p><a href=\"https://i.stack.imgur.com/3iix0.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/3iix0.png\" alt=\"enter image description here\" /></a></p>\n<p>and in the template I call it by this:</p>\n<pre><code>&lt;td&gt;&lt;a href=' {% static  &quot;/subfolder/&quot; %}{{ datarow.path }}'&gt;Open Document&lt;/a&gt;&lt;/td&gt;\n</code></pre>\n"}], "is_answered": true, "answer_count": 1, "last_activity_date": 1626774165, "question_id": 68437914, "title": "Add more than 1 folder (network path) to static files with Django on IIS", "body": "<p>I have a django website deployed on an IIS Server.  in it, I have 2 different network paths I need to access via static</p>\n<pre><code>STATIC_URL = '/static/'\n\nSTATICFILES_DIRS = [\n    &quot;//server1/Shared1/folder/&quot;, &quot;//Server2/folder2/&quot;,\n]\n</code></pre>\n<p>Now, currently my IIS has a static virtual directory that is set to &quot;server1&quot;\nthis allows me to work with all the files I have in that shared network drive and opertate properly.</p>\n<p><a href=\"https://i.stack.imgur.com/LnSjO.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/LnSjO.png\" alt=\"enter image description here\" /></a></p>\n<p>The issue comes when I try to work with any files in the &quot;server2&quot; I don't know how to add it. I understand that exists something called &quot;static root&quot; but for that I need to do a &quot;collect static&quot; in this case, I can't do a collect static since both servers have over 60gb of data that I need to access.</p>\n<p>Is there a way I'm not seeing for adding this second server to be able to be used via IIS?</p>\n<p><a href=\"https://i.stack.imgur.com/HVtYc.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/HVtYc.png\" alt=\"enter image description here\" /></a></p>\n"}